<template>
    <main>
        <h1>Глубокий Разум (Deep Thought)</h1>
        <blockquote>
            <p>— Хорошо, — сказал компьютер и снова погрузился в тишину. Двое мужчин заерзали. Напряжение было невыносимым.<br>— Тебе это действительно не понравится, — заметил Глубокий Разум.
                <br>"Расскажи нам!"<br>— Хорошо, — сказал Глубокий Разум. «Ответ на великий вопрос…»<br>«Да…!»<br>— О Жизни, Вселенной и обо всем… — сказал Глубокий Разум.<br>"Да…!"<br>— Это… — сказал Глубокий Разум <br> и сделал паузу.<br>"Да…!"<br>«Это…»<br>«Да…!!!…?»<br>— Сорок два, — сказал Глубокий Разум с бесконечным величием и спокойствием.</p>
            <p>— Автостопом по Галактике , Дуглас Адамс</p>
        </blockquote>
        <p>В <code class="code">deep.py</code>, реализуйте программу, которая запрашивает у пользователя ответ на Великий вопрос о жизни, Вселенной и всего остального, выводя, <code class="code">Yes</code> если пользователь вводит <code class="code">42</code> или <code class="code">forty-two</code> или <code class="code">forty two</code>(без учета регистра). В противном случае вывод <code class="code">No</code>.</p>
        <details>
            <summary>Подсказки</summary>
            <ul>
                <li>Нет необходимости преобразовывать ввод пользователя в int, если вы проверяете равенство с помощью "42"(str), а не 42(int)!</li>
                <li>Ничего страшного, если ваш вывод или вывод пользователя переносятся на несколько строк.</li>
            </ul>
        </details>
        <h2>Демо</h2>
        <img src="../../assets/week1/demo_deep.png" alt="">
        <h2>Перед тем как приступить к заданию</h2>
        <p>Перейдите по ссылке <a href="https://code.cs50.io/">code.cs50.io</a> и зайдите в свой аккаунт. Выполните команду <code class="code">cd</code> в вашем терминальном окне. Ваше терминальное окно должно выглядить как представлено ниже:</p>
        <pre class="highlight"><code>$</code></pre>
        <p>Следующая команда</p>
        <pre class="highlight"><code>mkdir deep</code></pre>
        <p>создаст папку <code class="code">deep</code> в вашем рабочем пространстве.</p>
        <p>Затем выполните</p>
        <pre class="highlight"><code>cd deep</code></pre>
        <p>чтобы изменить директорию в папке. Вы должны увидеть в терминале <code class="code">deep/ $</code>. Вы можете сейчас выполнить</p>
        <pre class="highlight"><code>code deep.py</code> </pre>
        <p>чтобы создать файл с именем , <code class="code"> deep.py</code>в котором вы будете писать свою программу.</p>
        <h2>Как проверить</h2>
        <p>Вот как протестировать код вручную:</p>
        <ul>
            <li>Запустите вашу программу с помощью команды <code class="code">python deep.py</code>. Введите  <code class="code">42</code> и нажмите Enter. Ваша программа должна вывести:</li>
            <pre class="highlight"><code> Yes</code></pre>
            <li>Запустите вашу программу с помощью команды <code class="code">python deep.py</code>. Введите  <code class="code">Forty Two</code> и нажмите Enter.Ваша программа должна вывести:</li>
            <pre class="highlight"><code>Yes</code></pre>
            <li>Запустите вашу программу с помощью команды <code class="code">python deep.py</code>. Введите  <code class="code">forty-two</code> и нажмите Enter. Ваша программа должна вывести:</li>
            <pre class="highlight"><code>Yes</code></pre>
            <li>Запустите вашу программу с помощью команды <code class="code">python deep.py</code>. Введите  <code class="code">50</code> и нажмите Enter. Ваша программа должна вывести:</li>
            <pre class="highlight"><code>No</code></pre>
        </ul>
        <p>Вы можете выполнить приведенную ниже команду, чтобы проверить свой код с помощью <code>check50</code>,являющейся программой которой CS50 будет проверять ваш код при отправке. Но перед отправкой обязательно протестируйте свой код сами!</p>
        <pre  class="highlight"><code>check50 cs50/problems/2022/python/deep</code></pre>
        <p>Зеленые смайлики означают, что ваша программа прошла проверку! Красные означают, что ваша программа выводит что-то неожиданное. Посетите URL-адрес, который выводит <code class="code">check50</code>, чтобы увидеть ответ <code class="code">check50</code>, переданный вашей программе, какой вывод она ожидала и какой вывод фактически выдала ваша программа.</p>
        <h2>Как отправить</h2>
        <p> В своем терминале выполните следующее, чтобы отправить свою работу.</p>
        <pre class="highlight"><code>submit50 cs50/problems/2022/python/deep</code></pre>
    </main>
</template>