<template>
<main >
        <div class="welcome-page">
                <div >
                    <h1>Добро пожаловать</h1>
                    <div>
                        <p>Введение в программирование с использованием языка программирования Python. Узнайте, как читать и писать код, а также как его тестировать и «отлаживать». Курс предназначен для студентов с опытом программирования или без него, которые хотели бы изучить Python. Узнайте о функциях, параметрах и   возвращаемых значениях, переменныx и типах данных, условных и логических выражениях, а также о циклах. Узнайте, как обрабатывать исключения, находить и исправлять ошибки, и писать модульные тесты, использовать сторонние библиотеки,проверять и извлекать данные с помощью регулярных выражений, моделировать объекты реального мира с помощью классов, объектов, методов и свойств, читать и писать файлы. 
                            Большое количество практических зааданий. Упражнения, вдохновленные реальными задачами программирования. Программное обеспечение не требуется, кроме веб-браузер, или вы можете писать код на своем ПК или Mac.
                        </p>
                        <p>
                            В то время как сам <a href="https://cs50.harvard.edu/x">CS50x</a> фокусируется на компьютерных науках в целом, а также на программировании на C, Python, SQL и JavaScript, этот курс, также известный как CS50P, полностью сосредоточен на программировании на Python. Вы можете пройти CS50P до CS50x, во время CS50x или после CS50x. Но для ознакомления с самой информатикой все равно стоит брать CS50x!
                        </p>
                        <details>
                            <summary>Смотреть интро</summary>
                            <iframe width="1214" height="682" src="https://www.youtube.com/embed/OvKCESUCWII" title="CS50P - Introduction" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
                        </details>
                    </div>
                </div>
                <div>
                    <h1>Как пройти этот курс</h1>
                    <p>Даже не являясь студентом Гарварда, вы можете пройти этот курс бесплатно через OpenCourseWare, пройдя все 10 недель курса. Если вы хотите отправить набор проблем или финальный проект и получить обратную связь, зарегестрируйтесь на <a href="https://courses.edx.org/register">edX</a>, если еще не зарегистрированы. Задавайте вопросы, которые будут возникать по мере прохождения курса,через любое сообщество курса(ссылки на сообщества приведены в боковом меню)</p>
                    <ul>
                        <li>Если вас интересует <a href="https://www.edx.org/verified-certificate">проверенный сертификат</a> от edX , зарегистрируйтесь на сайте <a href="https://cs50.edx.org/python">cs50.edx.org/python</a>. </li>
                        <li>Если вас интересует <a href="https://www.edx.org/professional-certificate">профессиональный сертификат</a> от edX, зарегистрируйтесь на сайте<a href="https://cs50.edx.org/programs/python"> cs50.edx.org/programs/python</a> (для Python) или <a href="https://cs50.edx.org/programs/data">cs50.edx.org/programs/data</a>  (для Data Science).</li>
                    </ul>
                </div>
                <div>
                    <h1>Как преподавать этот курс</h1>
                    <p>Если вы преподаватель, вы можешь использовать или адаптировать эти материалы для своего курса в соответствии с лицензией.</p>
                </div>
                <div>
                    <h1>Дисклеймер</h1>
                    <p>Сайт является только переводом Гарвадского курса <a href="https://cs50.harvard.edu/python/2022/">https://cs50.harvard.edu/python/2022/</a>. 
                        <br> Сайт содержит ссылки на внешние веб-сайты третьих лиц, на содержание которых мы не можем повлиять. В связи с этим мы не можем брать на себя ответственность за содержание чужих страниц. За содержание страниц, на которые ведут ссылки, всегда отвечает соответствующий оферент или владелец сайта. На момент создания ссылок, сайты, на которые они ведут, были проверены на предмет нарушения закона. На момент создания ссылок, противозаконный контент обнаружен не был. Мы не можем обеспечить постоянный контроль содержимого сайтов, на которые ведут ссылки, без конкретных указаний на нарушение закона. При обнаружении фактов нарушения закона, подобные ссылки будут сразу же удалены.</p>
                    <strong>Автор сайта не претендут на какие-либо права относительно курса и является только переводчиком</strong>
                </div>
            </div>
    </main>
</template>

<script>
export default {
  name: 'HelloWorld',
  props: {
    msg: String
  }
}
</script>
<style scoped>

h1 {
    margin: 1rem 0;
    font-size: 2rem;
    border-bottom: 1px solid white;
    padding-bottom: 1rem;
}
</style>

